read_verilog sap.v
# synth_coolrunner2 -top sap
synth_xilinx -top sap -flatten -edif sap.edif
