read_verilog sap.v
# synth_coolrunner2 -top sap
synth_xilinx -top top -flatten -edif sap.edif
